helloartillery.yaml
config:
  target: https://en.wikipedia.org/wiki
  # Load the Playwright engine:
  engines:
    playwright:
      extendedMetrics: true
      launchOptions:
        headless: true

  # Path to JavaScript file that defines Playwright test functions
  # TypeScript is also supported
  processor: './tests/artillery/load.ts'
  phases:
    #inject one user every 1s
    # - name: constantArrival
    #   duration: 3
    #   arrivalRate: 1

    #fixed arrival
    # - name: fixedArrival
    #   duration: 1
    #   arrivalCount: 6
    #pause for 102s
    # - name: pause
    #   pause: 50
    
    # ramp up to 4 users in 5s
    # - name: ramp-up
    #   duration: 5
    #   arrivalRate: 1
    #   rampTo: 4

    #every second 6 users arrives but no more than 6 users can exist => 6 users should operate at all the time
    - name: constant-6-users
      duration: '1m'
      arrivalRate: 6
      maxVusers: 6
  

scenarios:
  - engine: playwright
    testFunction: artilleryScript