helloartillery.yaml
config:
  target: https://en.wikipedia.org/wiki
  # Load the Playwright engine:
  engines:
    playwright:
      launchOptions:
        headless: true

  # Path to JavaScript file that defines Playwright test functions
  # TypeScript is also supported
  processor: './tests/artillery/load.ts'
  phases:
    #inject one user every 1s
    # - name: constantArrival
    #   duration: 3
    #   arrivalRate: 1

    #fixed arrival
    - name: fixedArrival
      duration: 5
      arrivalCount: 6
    #pause for 102s
    - name: pause
      pause: 10
    
    # ramp up to 4 users in 5s
    # - name: ramp-up
    #   duration: 5
    #   arrivalRate: 1
    #   rampTo: 4

    
scenarios:
  - engine: playwright
    testFunction: artilleryScript